euler/digit-fifth-powers.org
#+title: Digit fifth powers

Digit fifth powers
Problem 30

Surprisingly there are only three numbers that can be written as the sum of fourth powers of their digits:

    1634 = 14 + 64 + 34 + 44
    8208 = 84 + 24 + 04 + 84
    9474 = 94 + 44 + 74 + 44

As 1 = 14 is not a sum it is not included.

The sum of these numbers is 1634 + 8208 + 9474 = 19316.

Find the sum of all the numbers that can be written as the sum of fifth powers of their digits.

Code:
#+begin_src emacs-lisp
;;; digit-fifth-powers.el --- Compute the sum of numbers to which their digits elevated to some exponent is themselves.
;;; Commentary:
;;; Code:

(require 'dash)

(defun number-to-digits (n)
  "Compute the number N into its digit as list."
  (mapcar (lambda (x) (- x ?0)) (number-to-string n)))

(defun sum-of-digits-elevated-to-exponent (n e)
  "Compute the sum of the number N's digits to the exponent E."
  (->> n
    number-to-digits
    (--map (expt it e))
    (apply '+)))

(defun compute-numbers-which-sum-of-digits-elevated-to-exponent-is-itself (l e)
  "Filter L for which the sum of their digits to the exponent E is itself."
  (--filter (= (sum-of-digits-elevated-to-exponent it e) it) l))

(defun sum-of-numbers-which-sum-of-digits-elevated-to-exponent-is-itself (e)
  "Compute the sum of the digits to the exponent E."
  (let ((upper-limit (* e (expt 9 e))))
    (--> (number-sequence 2 upper-limit)
      (compute-numbers-which-sum-of-digits-elevated-to-exponent-is-itself it e)
      (apply '+ it))))

(provide 'digit-fifth-powers)
;;; digit-fifth-powers ends here

(sum-of-digits-to-exponent 5)
#+end_src

#+RESULTS:
: 443839

Tests:
#+begin_src emacs-lisp
(require 'ert)
(require 'ert-expectations)
(require 'el-mock)

(expectations
 (desc "compute-numbers-which-sum-of-digits-is-itself")
 (expect '(1634 8208 9474)
         (compute-numbers-which-sum-of-digits-is-itself '(1634 8208 9474 1000) 4))
 (expect '(4150 4151 54748 92727 93084 194979)
         (compute-numbers-which-sum-of-digits-is-itself (number-sequence 2 295245) 5)))

(expectations
 (expect 19316
         (sum-of-digits-to-exponent 4))
 (expect 443839
         (sum-of-digits-to-exponent 5)))
#+end_src
